rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file    app_ai.c
 * @brief   Minimal AI runtime bootstrap helpers.
 ******************************************************************************
 */
/* USER CODE END Header */

#include "app_ai.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <stddef.h>
#include <string.h>
#include <stdint.h>

#include "debug_console.h"
#include "app_inference_calibration.h"
#define LL_ATON_PLATFORM LL_ATON_PLAT_STM32N6
#define LL_ATON_OSAL LL_ATON_OSAL_THREADX
#include "tx_api.h"
#include "ll_aton_rt_user_api.h"
#include "ll_aton.h"
#include "ll_aton_runtime.h"
#include "app_filex.h"
#include "stm32n6xx_nucleo_xspi.h"
#include "npu_cache.h"
#include "stm32n6xx_hal.h"

/*
 * The AI bring-up path is very verbose in Debug builds and the format strings
 * alone can overflow the internal ROM region. Keep the model execution path
 * intact, but compile the per-step console chatter out unless a developer
 * explicitly re-enables it for a size-debugging session.
 */
#ifndef APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS
#define APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS 0
#endif
#if !APP_AI_ENABLE_VERBOSE_CONSOLE_LOGS
#undef DebugConsole_Printf
#define DebugConsole_Printf(...) ((void) 0)
#endif
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define APP_AI_CACHE_LINE_BYTES 32U
#define APP_AI_CAPTURE_FRAME_WIDTH_PIXELS 224U
#define APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS 224U
#define APP_AI_CAPTURE_FRAME_BYTES_PER_PIXEL 2U
#define APP_AI_CAPTURE_FRAME_BYTES \
		(APP_AI_CAPTURE_FRAME_WIDTH_PIXELS * APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS \
				* APP_AI_CAPTURE_FRAME_BYTES_PER_PIXEL)
#define APP_AI_MODEL_INPUT_FLOAT_COUNT \
		(APP_AI_CAPTURE_FRAME_WIDTH_PIXELS * APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS \
				* 3U)
/* Bright-object detector threshold used to find the gauge face before
 * cropping and resizing the tensor. 80 was a better fit than 60 on captured
 * frames because 60 was too loose and pulled in most of the background. */
#define APP_AI_GAUGE_BRIGHT_THRESHOLD      80U
/* Ignore a thin border while estimating the bright bbox so edge glare does not
 * drag the crop to x=0 or y=0. */
#define APP_AI_GAUGE_CROP_BORDER_PIXELS    16U
/* Feed the model a stable grayscale tensor from Y luma only.
 * The RGB reconstruction path was collapsing to a green-only tensor on board,
 * which is a worse mismatch than replicated luminance for this gauge task. */
#define APP_AI_YUV422_INPUT_LUMA_ONLY      1U
/* Dataset-wide mean dial crop from the CVAT boxes used during training. */
#define APP_AI_TRAINING_CROP_X_MIN_RATIO   0.1027f
#define APP_AI_TRAINING_CROP_Y_MIN_RATIO   0.2573f
#define APP_AI_TRAINING_CROP_X_MAX_RATIO   0.7987f
#define APP_AI_TRAINING_CROP_Y_MAX_RATIO   0.8071f
#define APP_AI_MODEL_INPUT_FLOAT_BYTES \
		(APP_AI_MODEL_INPUT_FLOAT_COUNT * sizeof(float))
#define APP_AI_MODEL_OUTPUT_FLOAT_BYTES   sizeof(float)
#define APP_AI_XSPI2_MODEL_IMAGE_PATH     "atonbuf.xSPI2.raw"
#define APP_AI_XSPI2_PROGRAM_CHUNK_BYTES   4096U
#define APP_AI_XSPI2_ERASE_BLOCK_BYTES     (64U * 1024U)
#define APP_AI_XSPI2_PROBE_BYTES           16U
/* Model blob sits after the FSBL (0x70000000) and signed app (0x70100000).
 * Must match FLASH_MODEL address in flash_boot.bat and EXTRAM origin in the
 * linker script. The chip offset is the model base minus the xSPI2 window base. */
#define APP_AI_XSPI2_MODEL_BASE_ADDR      0x70200000UL
#define APP_AI_XSPI2_CHIP_BASE_ADDR       0x70000000UL
#define APP_AI_XSPI2_MODEL_CHIP_OFFSET    (APP_AI_XSPI2_MODEL_BASE_ADDR - APP_AI_XSPI2_CHIP_BASE_ADDR)
/* FileX can take a while to recover from card init retries or media errors.
 * Give the loader a longer window so we do not give up just before the stack
 * settles. */
#define APP_AI_FILEX_MEDIA_READY_TIMEOUT_MS 180000U
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
/* USER CODE BEGIN PV */
static bool app_ai_runtime_initialized = false;
static volatile float app_ai_last_inference_value = 0.0f;
static volatile bool app_ai_last_inference_valid = false;
static bool app_ai_npu_hw_initialized = false;
static bool app_ai_xspi2_initialized = false;
__attribute__((section(".xspi2_pool"), aligned(APP_AI_CACHE_LINE_BYTES)))
uint8_t _mem_pool_xSPI2_mobilenetv2_scalar_hardcase_warmstart_int8[32U] = {
	0U,
};
static uint8_t app_ai_xspi2_program_buffer[APP_AI_XSPI2_PROGRAM_CHUNK_BYTES];
/* Start/tail signatures for the current atonbuf.xSPI2.raw.
 * Update these when a new model is exported by running:
 *   python3 -c "
 *     d=open('st_ai_output/atonbuf.xSPI2.raw','rb').read()
 *     print('start:', bytes(d[:16]).hex())
 *     print('tail: ', bytes(d[-16:]).hex())" */
static const uint8_t app_ai_xspi2_signature_start[APP_AI_XSPI2_PROBE_BYTES] = {
	0xF4U, 0x11U, 0x27U, 0xE6U, 0xE1U, 0xF0U, 0xEFU, 0x00U,
	0x09U, 0x02U, 0x39U, 0xEBU, 0x0FU, 0xE1U, 0x0EU, 0xFFU,
};
static const uint8_t app_ai_xspi2_signature_tail[APP_AI_XSPI2_PROBE_BYTES] = {
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U,
	0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0x00U, 0xDAU,
};
/* Size of the model image last programmed to xSPI2. Set during provisioning,
 * used by the verify functions for the tail probe offset. */
static ULONG app_ai_xspi2_programmed_size = 0UL;

/* Declare the generated NN instance locally so the dry-run helper can run the
 * AtoNN runtime on the exact network produced by Cube.AI. */
LL_ATON_DECLARE_NAMED_NN_INSTANCE_AND_INTERFACE(
		mobilenetv2_scalar_hardcase_warmstart_int8);
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
/* USER CODE BEGIN PFP */
static const LL_Buffer_InfoTypeDef *AppAI_GetInputBufferInfo(void);
static const LL_Buffer_InfoTypeDef *AppAI_GetOutputBufferInfo(void);
static const LL_Buffer_InfoTypeDef *AppAI_FindBufferInfoByName(
		const LL_Buffer_InfoTypeDef *buffer_list, const char *name);
static void AppAI_LogInitFailure(const char *step);
static void AppAI_LogXspi2LoadFailure(const char *step, UINT fx_status,
		int32_t bsp_status);
static void AppAI_LogXspi2ProgramChunkProgress(ULONG chunk_index,
		ULONG flash_offset, ULONG chunk_size);
static void AppAI_LogXspi2PrefixBytes(const char *label,
		const uint8_t *bytes);
static void AppAI_LogFrameSignature(const uint8_t *frame_bytes,
		size_t frame_size);
static void AppAI_LogInputSignature(const float *input_buffer,
		size_t input_float_count);
static void AppAI_LogInputTensorWindow(const float *input_buffer,
		size_t input_float_count);
static void AppAI_LogTensorRowSamples(const char *label,
		const float *input_buffer, size_t tensor_width, size_t row_y,
		size_t x_min, size_t x_max);
static void AppAI_LogSourcePatch(const char *label, const uint8_t *frame_bytes,
		size_t frame_width_pixels, size_t center_x, size_t center_y,
		size_t radius_pixels);
static void AppAI_LogTensorPatch(const char *label, const float *input_buffer,
		size_t tensor_width, size_t center_x, size_t center_y,
		size_t radius_pixels);
static void AppAI_LogSourceCropWindow(const uint8_t *frame_bytes,
		size_t frame_size, size_t frame_width_pixels, size_t frame_height_pixels,
		size_t crop_x_min, size_t crop_y_min, size_t crop_width,
		size_t crop_height);
static void AppAI_LogInt8BufferSignature(const char *label,
		const int8_t *buffer_ptr, size_t buffer_len_bytes);
static void AppAI_LogRawBufferSignature(const char *label,
		const uint8_t *buffer_ptr, size_t buffer_len_bytes);
static const char *AppAI_BufferTypeName(const LL_Buffer_InfoTypeDef *buffer_info);
static void AppAI_LogBufferInfoAndSignature(const char *label,
		const LL_Buffer_InfoTypeDef *buffer_info);
static bool AppAI_EstimateGaugeCropBoxFromYuv422(const uint8_t *frame_bytes,
		size_t frame_size, size_t frame_width_pixels, size_t frame_height_pixels,
		size_t *crop_x_min, size_t *crop_y_min, size_t *crop_width,
		size_t *crop_height);
static bool AppAI_LogXspi2ModelFilePrefix(FX_FILE *model_file_ptr);
static void AppAI_LogXspi2FlashPrefix(void);
static void AppAI_LogXspi2MappedScaleBytes(void);
static void AppAI_LogXspi2IndirectAndMappedPrefix(void);
static void AppAI_LogFloatApprox(const char *label, float value);
static void AppAI_LogInferenceResult(
		const LL_Buffer_InfoTypeDef *output_buffer_info);
static int AppAI_ApplyCacheRange(uint32_t start_addr, uint32_t end_addr,
		bool clean, bool invalidate);
static void AppAI_EnableNpuMemoryAndCaches(void);
static void AppAI_ConfigureNpuAccessControl(void);
static void AppAI_ConfigureNpuRisafDefaults(void);
static bool AppAI_EnsureXspi2ModelImageReady(void);
static bool AppAI_Xspi2ModelImageMatchesFlash(void);
static bool AppAI_ProgramXspi2ModelImageFromSd(void);
static bool AppAI_WaitForFileXMediaReady(uint32_t timeout_ms);
static bool AppAI_RuntimeInitStepwise(void);
static bool AppAI_PreprocessYuv422FrameToFloatInput(const uint8_t *frame_bytes,
		size_t frame_size, float *input_buffer, size_t input_float_count);
static float AppAI_ClampNormalizedFloat(float value);
static uint8_t AppAI_ReadYuv422Luma(const uint8_t *frame_bytes,
		size_t frame_width_pixels, size_t source_x, size_t source_y);
static void AppAI_ReadYuv422Quartet(const uint8_t *frame_bytes,
		size_t frame_width_pixels, size_t source_x, size_t source_y,
		uint8_t *quad_out);
static float AppAI_ReadNormalizedGrayFromYuv422Pixel(const uint8_t *frame_bytes,
		size_t frame_width_pixels, size_t source_x, size_t source_y);
static void AppAI_ReadRgbFromYuv422Pixel(const uint8_t *frame_bytes,
		size_t frame_width_pixels, size_t source_x, size_t source_y,
		float *r_out, float *g_out, float *b_out);
int mcu_cache_clean_range(uint32_t start_addr, uint32_t end_addr) {
	return AppAI_ApplyCacheRange(start_addr, end_addr, true, false);
}

int mcu_cache_invalidate_range(uint32_t start_addr, uint32_t end_addr) {
	return AppAI_ApplyCacheRange(start_addr, end_addr, false, true);
}

static bool AppAI_EnsureNpuHardwareReady(void) {
	if (app_ai_npu_hw_initialized) {
		return true;
	}

	__HAL_RCC_NPU_CLK_ENABLE();
	__HAL_RCC_NPU_FORCE_RESET();
	__HAL_RCC_NPU_RELEASE_RESET();
	__HAL_RCC_NPU_CLK_SLEEP_DISABLE();

