rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	__HAL_RCC_CACHEAXI_CLK_ENABLE();
	__HAL_RCC_CACHEAXI_FORCE_RESET();
	__HAL_RCC_CACHEAXI_RELEASE_RESET();
	__HAL_RCC_CACHEAXI_CLK_SLEEP_DISABLE();

	AppAI_EnableNpuMemoryAndCaches();

	npu_cache_init();
	npu_cache_enable();

	AppAI_ConfigureNpuAccessControl();
	AppAI_ConfigureNpuRisafDefaults();

	app_ai_npu_hw_initialized = true;
	return true;
}

static bool AppAI_EnsureXspi2MemoryReady(void) {
	BSP_XSPI_NOR_Init_t flash = { 0 };
	RCC_PeriphCLKInitTypeDef periph_clk = { 0 };
	int32_t bsp_status = BSP_ERROR_NONE;

	if (app_ai_xspi2_initialized) {
		return true;
	}

	/* If a prior verify attempt left the flash in memory-mapped mode, erase and
	 * write commands will fail.  Take it back to indirect mode first. DeInit
	 * handles this cleanly regardless of the current BSP context state. */
	(void) BSP_XSPI_NOR_DeInit(0U);

	periph_clk.PeriphClockSelection = RCC_PERIPHCLK_XSPI2;
	periph_clk.Xspi2ClockSelection = RCC_XSPI2CLKSOURCE_HCLK;
	if (HAL_RCCEx_PeriphCLKConfig(&periph_clk) != HAL_OK) {
		return false;
	}

	flash.InterfaceMode = BSP_XSPI_NOR_OPI_MODE;
	flash.TransferRate = BSP_XSPI_NOR_STR_TRANSFER;
	bsp_status = BSP_XSPI_NOR_Init(0U, &flash);
	if (bsp_status != BSP_ERROR_NONE) {
		DebugConsole_Printf("[AI] BSP_XSPI_NOR_Init for provisioning failed: %ld\r\n",
				(long) bsp_status);
		return false;
	}

	return true;
}

static bool AppAI_ReconfigureXspi2ForRuntime(void) {
	BSP_XSPI_NOR_Init_t flash = { 0 };
	int32_t bsp_status = BSP_ERROR_NONE;

	/* Drop out of memory-mapped mode before changing the flash transfer rate. */
	(void) BSP_XSPI_NOR_DisableMemoryMappedMode(0U);
	(void) BSP_XSPI_NOR_DeInit(0U);

	flash.InterfaceMode = BSP_XSPI_NOR_OPI_MODE;
	flash.TransferRate = BSP_XSPI_NOR_DTR_TRANSFER;
	bsp_status = BSP_XSPI_NOR_Init(0U, &flash);
	if (bsp_status != BSP_ERROR_NONE) {
		return false;
	}

	if (BSP_XSPI_NOR_EnableMemoryMappedMode(0U) != BSP_ERROR_NONE) {
		return false;
	}

	return true;
}

static bool AppAI_Xspi2ReadFlashProbe(const uint32_t flash_offset,
		const uint8_t *expected_bytes, const size_t expected_length) {
	uint8_t flash_bytes[APP_AI_XSPI2_PROBE_BYTES] = { 0U };

	if ((expected_bytes == NULL) || (expected_length == 0U)
			|| (expected_length > APP_AI_XSPI2_PROBE_BYTES)) {
		return false;
	}

	if (BSP_XSPI_NOR_Read(0U, flash_bytes,
			APP_AI_XSPI2_MODEL_CHIP_OFFSET + flash_offset,
			(uint32_t) expected_length) != BSP_ERROR_NONE) {
		return false;
	}

	return (memcmp(flash_bytes, expected_bytes, expected_length) == 0);
}

static bool AppAI_Xspi2ReadMappedProbe(const uint32_t flash_offset,
		const uint8_t *expected_bytes, const size_t expected_length) {
	const uint8_t *const flash_ptr = (const uint8_t *) (APP_AI_XSPI2_MODEL_BASE_ADDR
			+ flash_offset);

	if ((expected_bytes == NULL) || (expected_length == 0U)
			|| (expected_length > APP_AI_XSPI2_PROBE_BYTES)) {
		return false;
	}

	(void) mcu_cache_invalidate_range((uint32_t) flash_ptr,
			(uint32_t) flash_ptr + (uint32_t) expected_length);

	return (memcmp(flash_ptr, expected_bytes, expected_length) == 0);
}

static void AppAI_LogXspi2PrefixBytes(const char *label,
		const uint8_t *bytes) {
	if ((label == NULL) || (bytes == NULL)) {
		return;
	}

	DebugConsole_Printf(
			"[AI] %s %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X %02X\r\n",
			label, bytes[0], bytes[1], bytes[2], bytes[3], bytes[4], bytes[5],
			bytes[6], bytes[7], bytes[8], bytes[9], bytes[10], bytes[11],
			bytes[12], bytes[13], bytes[14], bytes[15]);
}

/**
 * @brief Print a compact signature for the captured input frame.
 *
 * This makes it easy to compare whether two runs actually fed different
 * camera data into the model.
 */
static void AppAI_LogFrameSignature(const uint8_t *frame_bytes,
		size_t frame_size) {
	uint8_t first_bytes[8U] = { 0U };
	uint32_t hash = 2166136261UL;
	size_t preview_count = 0U;

	if ((frame_bytes == NULL) || (frame_size == 0U)) {
		DebugConsole_Printf("[AI] Frame signature skipped: empty frame.\r\n");
		return;
	}

	preview_count = (frame_size < sizeof(first_bytes)) ? frame_size
			: sizeof(first_bytes);
	for (size_t index = 0U; index < preview_count; index++) {
		first_bytes[index] = frame_bytes[index];
	}

	for (size_t index = 0U; index < frame_size; index++) {
		hash ^= frame_bytes[index];
		hash *= 16777619UL;
	}

	DebugConsole_Printf(
			"[AI] Frame signature: len=%lu hash=0x%08lX first8=[%02X %02X %02X %02X %02X %02X %02X %02X]\r\n",
			(unsigned long) frame_size, (unsigned long) hash,
			(unsigned int) first_bytes[0], (unsigned int) first_bytes[1],
			(unsigned int) first_bytes[2], (unsigned int) first_bytes[3],
			(unsigned int) first_bytes[4], (unsigned int) first_bytes[5],
			(unsigned int) first_bytes[6], (unsigned int) first_bytes[7]);
}

/**
 * @brief Print a compact signature for the preprocessed model input tensor.
 *
 * This tells us whether the captured scene is still distinct after the
 * YUV422-to-RGB preprocessing and dial ROI crop.
 */
static void AppAI_LogInputSignature(const float *input_buffer,
		size_t input_float_count) {
	const uint8_t *bytes = NULL;
	uint8_t first_bytes[8U] = { 0U };
	uint32_t first_words[4U] = { 0U };
	uint32_t hash = 2166136261UL;
	size_t byte_count = 0U;
	size_t preview_bytes = 0U;
	size_t preview_words = 0U;

	if ((input_buffer == NULL) || (input_float_count == 0U)) {
		DebugConsole_Printf("[AI] Input signature skipped: empty tensor.\r\n");
		return;
	}

	bytes = (const uint8_t *) input_buffer;
	byte_count = input_float_count * sizeof(float);
	preview_bytes = (byte_count < sizeof(first_bytes)) ? byte_count
			: sizeof(first_bytes);
	preview_words = (input_float_count < 4U) ? input_float_count : 4U;

	for (size_t index = 0U; index < preview_bytes; index++) {
		first_bytes[index] = bytes[index];
	}

	for (size_t index = 0U; index < preview_words; index++) {
		(void) memcpy(&first_words[index], &input_buffer[index],
				sizeof(uint32_t));
	}

	for (size_t index = 0U; index < byte_count; index++) {
		hash ^= bytes[index];
		hash *= 16777619UL;
	}

