rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	DebugConsole_Printf(
			"[AI] Input signature: floats=%lu hash=0x%08lX first8=[%02X %02X %02X %02X %02X %02X %02X %02X] first4=[0x%08lX,0x%08lX,0x%08lX,0x%08lX]\r\n",
			(unsigned long) input_float_count, (unsigned long) hash,
			(unsigned int) first_bytes[0], (unsigned int) first_bytes[1],
			(unsigned int) first_bytes[2], (unsigned int) first_bytes[3],
			(unsigned int) first_bytes[4], (unsigned int) first_bytes[5],
			(unsigned int) first_bytes[6], (unsigned int) first_bytes[7],
			(unsigned long) first_words[0], (unsigned long) first_words[1],
			(unsigned long) first_words[2], (unsigned long) first_words[3]);
}

/**
 * @brief Print a small diagnostic window from the center of the input tensor.
 *
 * The top-left bytes can be padding or background, so this summary looks at the
 * tensor region where the dial should live after cropping and resizing.
 */
static void AppAI_LogInputTensorWindow(const float *input_buffer,
		size_t input_float_count) {
	const size_t tensor_width = (size_t) APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const size_t tensor_height = (size_t) APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	const size_t center_x = tensor_width / 2U;
	const size_t center_y = tensor_height / 2U;
	const size_t window_radius = 8U;
	const size_t x_min = (center_x > window_radius) ? (center_x - window_radius)
			: 0U;
	const size_t y_min = (center_y > window_radius) ? (center_y - window_radius)
			: 0U;
	const size_t x_max = ((center_x + window_radius) < tensor_width) ?
			(center_x + window_radius) : tensor_width;
	const size_t y_max = ((center_y + window_radius) < tensor_height) ?
			(center_y + window_radius) : tensor_height;
	float sum_r = 0.0f;
	float sum_g = 0.0f;
	float sum_b = 0.0f;
	float min_r = 1.0f;
	float min_g = 1.0f;
	float min_b = 1.0f;
	float max_r = 0.0f;
	float max_g = 0.0f;
	float max_b = 0.0f;
	float center_r = 0.0f;
	float center_g = 0.0f;
	float center_b = 0.0f;
	unsigned long center_r_milli = 0U;
	unsigned long center_g_milli = 0U;
	unsigned long center_b_milli = 0U;
	unsigned long mean_r_milli = 0U;
	unsigned long mean_g_milli = 0U;
	unsigned long mean_b_milli = 0U;
	unsigned long min_r_milli = 0U;
	unsigned long min_g_milli = 0U;
	unsigned long min_b_milli = 0U;
	unsigned long max_r_milli = 0U;
	unsigned long max_g_milli = 0U;
	unsigned long max_b_milli = 0U;
	size_t sample_count = 0U;

	if ((input_buffer == NULL) || (input_float_count < APP_AI_MODEL_INPUT_FLOAT_COUNT)) {
		return;
	}

	for (size_t y = y_min; y < y_max; y++) {
		for (size_t x = x_min; x < x_max; x++) {
			const size_t pixel_index = (y * tensor_width) + x;
			const size_t base = pixel_index * 3U;
			const float r = input_buffer[base + 0U];
			const float g = input_buffer[base + 1U];
			const float b = input_buffer[base + 2U];

			if (r < min_r) {
				min_r = r;
			}
			if (g < min_g) {
				min_g = g;
			}
			if (b < min_b) {
				min_b = b;
			}
			if (r > max_r) {
				max_r = r;
			}
			if (g > max_g) {
				max_g = g;
			}
			if (b > max_b) {
				max_b = b;
			}

			sum_r += r;
			sum_g += g;
			sum_b += b;
			sample_count++;
		}
	}

	{
		const size_t center_base = ((center_y * tensor_width) + center_x) * 3U;
		center_r = input_buffer[center_base + 0U];
		center_g = input_buffer[center_base + 1U];
		center_b = input_buffer[center_base + 2U];
	}

	if (sample_count == 0U) {
		return;
	}

	center_r_milli = (unsigned long) ((center_r * 1000.0f) + 0.5f);
	center_g_milli = (unsigned long) ((center_g * 1000.0f) + 0.5f);
	center_b_milli = (unsigned long) ((center_b * 1000.0f) + 0.5f);
	mean_r_milli = (unsigned long) ((sum_r / (float) sample_count) * 1000.0f
			+ 0.5f);
	mean_g_milli = (unsigned long) ((sum_g / (float) sample_count) * 1000.0f
			+ 0.5f);
	mean_b_milli = (unsigned long) ((sum_b / (float) sample_count) * 1000.0f
			+ 0.5f);
	min_r_milli = (unsigned long) (min_r * 1000.0f + 0.5f);
	min_g_milli = (unsigned long) (min_g * 1000.0f + 0.5f);
	min_b_milli = (unsigned long) (min_b * 1000.0f + 0.5f);
	max_r_milli = (unsigned long) (max_r * 1000.0f + 0.5f);
	max_g_milli = (unsigned long) (max_g * 1000.0f + 0.5f);
	max_b_milli = (unsigned long) (max_b * 1000.0f + 0.5f);

	DebugConsole_Printf(
			"[AI] Tensor center window: x=[%lu,%lu) y=[%lu,%lu) center_milli=[%lu %lu %lu] mean_milli=[%lu %lu %lu] min_milli=[%lu %lu %lu] max_milli=[%lu %lu %lu]\r\n",
			(unsigned long) x_min, (unsigned long) x_max, (unsigned long) y_min,
			(unsigned long) y_max, center_r_milli, center_g_milli,
			center_b_milli, mean_r_milli, mean_g_milli, mean_b_milli,
			min_r_milli, min_g_milli, min_b_milli, max_r_milli, max_g_milli,
			max_b_milli);

	AppAI_LogTensorRowSamples("top", input_buffer, tensor_width,
			y_min + ((y_max - y_min) / 4U), x_min, x_max);
	AppAI_LogTensorRowSamples("mid", input_buffer, tensor_width, center_y,
			x_min, x_max);
	AppAI_LogTensorRowSamples("bottom", input_buffer, tensor_width,
			y_min + (((y_max - y_min) * 3U) / 4U), x_min, x_max);
}

/**
 * @brief Print a few evenly spaced samples from one tensor row.
 *
 * This makes it easier to see whether the row contains dial markings, the
 * needle, or only flat background after the crop/resample step.
 */
static void AppAI_LogTensorRowSamples(const char *label,
		const float *input_buffer, size_t tensor_width, size_t row_y,
		size_t x_min, size_t x_max) {
	const size_t sample_count = 5U;
	size_t positions[5U] = { 0U };

	if ((label == NULL) || (input_buffer == NULL) || (tensor_width == 0U)
			|| (x_max <= x_min)) {
		return;
	}

	{
		const size_t span = (x_max > x_min) ? (x_max - x_min - 1U) : 0U;
		positions[0U] = x_min;
		positions[1U] = x_min + (span / 4U);
		positions[2U] = x_min + (span / 2U);
		positions[3U] = x_min + ((span * 3U) / 4U);
		positions[4U] = (x_max > 0U) ? (x_max - 1U) : 0U;
	}

	DebugConsole_Printf("[AI] Row %s y=%lu:",
			label, (unsigned long) row_y);
	for (size_t index = 0U; index < sample_count; index++) {
		const size_t pixel_index = (row_y * tensor_width) + positions[index];
		const size_t base = pixel_index * 3U;
		const unsigned long r_milli =
				(unsigned long) (input_buffer[base + 0U] * 1000.0f + 0.5f);
		const unsigned long g_milli =
				(unsigned long) (input_buffer[base + 1U] * 1000.0f + 0.5f);
		const unsigned long b_milli =
				(unsigned long) (input_buffer[base + 2U] * 1000.0f + 0.5f);

		DebugConsole_Printf(" x=%lu rgb=[%lu %lu %lu]",
				(unsigned long) positions[index], r_milli, g_milli, b_milli);
	}
	DebugConsole_Printf("\r\n");
}

/**
 * @brief Print a compact luma patch from the source YUV422 frame.
 */
static void AppAI_LogSourcePatch(const char *label, const uint8_t *frame_bytes,
		size_t frame_width_pixels, size_t center_x, size_t center_y,
		size_t radius_pixels) {
	const size_t x_min = (center_x > radius_pixels) ? (center_x - radius_pixels)
			: 0U;
	const size_t y_min = (center_y > radius_pixels) ? (center_y - radius_pixels)
			: 0U;
	const size_t x_max = ((center_x + radius_pixels)
			< APP_AI_CAPTURE_FRAME_WIDTH_PIXELS) ? (center_x + radius_pixels)
			: (APP_AI_CAPTURE_FRAME_WIDTH_PIXELS - 1U);
	const size_t y_max = ((center_y + radius_pixels)
			< APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS) ? (center_y + radius_pixels)
			: (APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS - 1U);

	if ((label == NULL) || (frame_bytes == NULL) || (frame_width_pixels == 0U)) {
		return;
	}

