rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
		for (size_t x = APP_AI_GAUGE_CROP_BORDER_PIXELS;
				x < (frame_width_pixels - APP_AI_GAUGE_CROP_BORDER_PIXELS); ++x) {
			const size_t pair_offset = row_offset + ((x & ~1U) * 2U);
			const size_t y_offset = pair_offset + (((x & 1U) != 0U) ? 2U : 0U);
			const uint8_t luma = frame_bytes[y_offset];

			if (luma < APP_AI_GAUGE_BRIGHT_THRESHOLD) {
				continue;
			}

			bright_count++;
			bright_sum_x += (uint64_t) x;
			bright_sum_y += (uint64_t) y;

			if (x < bright_x_min) {
				bright_x_min = x;
			}
			if (y < bright_y_min) {
				bright_y_min = y;
			}
			if (x > bright_x_max) {
				bright_x_max = x;
			}
			if (y > bright_y_max) {
				bright_y_max = y;
			}
		}
	}

	if (bright_count == 0U) {
		return false;
	}

	bright_center_x = (size_t) (bright_sum_x / (uint64_t) bright_count);
	bright_center_y = (size_t) (bright_sum_y / (uint64_t) bright_count);
	bbox_width = (bright_x_max - bright_x_min) + 1U;
	bbox_height = (bright_y_max - bright_y_min) + 1U;
	if ((bbox_width == 0U) || (bbox_height == 0U)) {
		return false;
	}

	/* Anchor a fixed training-sized crop on the bright-region centroid instead
	 * of using the full bright bbox, which was pulling in too much background. */
	if (training_crop_width == 0U) {
		return false;
	}
	if (training_crop_height == 0U) {
		return false;
	}

	left = (bright_center_x > (training_crop_width / 2U)) ?
			(bright_center_x - (training_crop_width / 2U)) : 0U;
	top = (bright_center_y > (training_crop_height / 2U)) ?
			(bright_center_y - (training_crop_height / 2U)) : 0U;
	right = left + training_crop_width;
	bottom = top + training_crop_height;
	if (right > frame_width_pixels) {
		right = frame_width_pixels;
		left = (right > training_crop_width) ? (right - training_crop_width) : 0U;
	}
	if (bottom > frame_height_pixels) {
		bottom = frame_height_pixels;
		top = (bottom > training_crop_height) ? (bottom - training_crop_height)
				: 0U;
	}

	if ((right <= left) || (bottom <= top)) {
		return false;
	}

	*crop_x_min = left;
	*crop_y_min = top;
	*crop_width = right - left;
	*crop_height = bottom - top;

	if ((*crop_width < min_crop_width) || (*crop_height < min_crop_height)) {
		return false;
	}

	return true;
}

static bool AppAI_LogXspi2ModelFilePrefix(FX_FILE *model_file_ptr) {
	uint8_t source_bytes[APP_AI_XSPI2_PROBE_BYTES] = { 0U };
	ULONG bytes_read = 0U;
	UINT fx_status = FX_SUCCESS;

	if (model_file_ptr == NULL) {
		return false;
	}

	fx_status = fx_file_read(model_file_ptr, source_bytes,
			APP_AI_XSPI2_PROBE_BYTES, &bytes_read);
	if ((fx_status != FX_SUCCESS)
			|| (bytes_read != APP_AI_XSPI2_PROBE_BYTES)) {
		DebugConsole_Printf(
				"[AI] xSPI2 source prefix read failed (fx=%lu n=%lu).\r\n",
				(unsigned long) fx_status, (unsigned long) bytes_read);
		return false;
	}

	AppAI_LogXspi2PrefixBytes("xSPI2 source prefix:", source_bytes);

	fx_status = fx_file_seek(model_file_ptr, 0U);
	if (fx_status != FX_SUCCESS) {
		DebugConsole_Printf(
				"[AI] xSPI2 source rewind failed (fx=%lu).\r\n",
				(unsigned long) fx_status);
		return false;
	}

	return true;
}

static bool AppAI_Xspi2ModelImageMatchesFlash(void) {
	if (!AppAI_Xspi2ReadFlashProbe(0U, app_ai_xspi2_signature_start,
			sizeof(app_ai_xspi2_signature_start))) {
		DebugConsole_Printf("[AI] xSPI2 verify failed at start signature.\r\n");
		return false;
	}

	if ((app_ai_xspi2_programmed_size >= APP_AI_XSPI2_PROBE_BYTES)
			&& !AppAI_Xspi2ReadFlashProbe(
					app_ai_xspi2_programmed_size - APP_AI_XSPI2_PROBE_BYTES,
					app_ai_xspi2_signature_tail,
					sizeof(app_ai_xspi2_signature_tail))) {
		DebugConsole_Printf("[AI] xSPI2 verify failed at tail signature.\r\n");
		return false;
	}

	return true;
}

static bool AppAI_Xspi2ModelImageMatchesMappedFlash(void) {
	if (!AppAI_Xspi2ReadMappedProbe(0U, app_ai_xspi2_signature_start,
			sizeof(app_ai_xspi2_signature_start))) {
		DebugConsole_Printf(
				"[AI] xSPI2 mapped verify failed at start signature.\r\n");
		return false;
	}

	if ((app_ai_xspi2_programmed_size >= APP_AI_XSPI2_PROBE_BYTES)
			&& !AppAI_Xspi2ReadMappedProbe(
					app_ai_xspi2_programmed_size - APP_AI_XSPI2_PROBE_BYTES,
					app_ai_xspi2_signature_tail,
					sizeof(app_ai_xspi2_signature_tail))) {
		DebugConsole_Printf(
				"[AI] xSPI2 mapped verify failed at tail signature.\r\n");
		return false;
	}

	return true;
}

static bool AppAI_ProgramXspi2ModelImageFromSd(void) {
	FX_MEDIA *media_ptr = NULL;
	FX_FILE model_file = { 0 };
	ULONG file_size = 0U;
	ULONG bytes_read = 0U;
	ULONG bytes_remaining = 0U;
	ULONG flash_offset = 0U;
	UINT fx_status = FX_SUCCESS;
	UINT tx_status = TX_SUCCESS;
	int32_t bsp_status = BSP_ERROR_NONE;

	if (!AppAI_WaitForFileXMediaReady(APP_AI_FILEX_MEDIA_READY_TIMEOUT_MS)) {
		AppAI_LogXspi2LoadFailure("FileX not ready", FX_MEDIA_NOT_OPEN,
				BSP_ERROR_NONE);
		return false;
	}

	tx_status = AppFileX_AcquireMediaLock();
	if (tx_status != TX_SUCCESS) {
		AppAI_LogXspi2LoadFailure("media lock", (UINT) tx_status, BSP_ERROR_NONE);
		return false;
	}

	media_ptr = AppFileX_GetMediaHandle();
	if (media_ptr == NULL) {
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("media handle", FX_MEDIA_NOT_OPEN,
				BSP_ERROR_NONE);
		return false;
	}

	if (fx_directory_default_set(media_ptr, FX_NULL) != FX_SUCCESS) {
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("default directory", FX_SUCCESS,
				BSP_ERROR_NONE);
		return false;
	}

	fx_status = fx_file_open(media_ptr, &model_file,
			(CHAR *) APP_AI_XSPI2_MODEL_IMAGE_PATH, FX_OPEN_FOR_READ);
	if (fx_status != FX_SUCCESS) {
		(void) fx_directory_default_set(media_ptr, FX_NULL);
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("file open", fx_status, BSP_ERROR_NONE);
		return false;
	}

	file_size = model_file.fx_file_current_file_size;
	if (file_size == 0U) {
		(void) fx_file_close(&model_file);
		(void) fx_directory_default_set(media_ptr, FX_NULL);
		AppFileX_ReleaseMediaLock();
		AppAI_LogXspi2LoadFailure("file size (empty)", FX_SUCCESS, BSP_ERROR_NONE);
		return false;
	}
	DebugConsole_Printf("[AI] Model file size: %lu bytes.\r\n",
			(unsigned long) file_size);

