rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	}
	HAL_RIF_RISAF_ConfigBaseRegion(risaf_hw, 0U, &risaf_conf);
	if (risaf == RISAF12_S) {
		
	}

	risaf_conf.Secure = RIF_ATTRIBUTE_NSEC;
	if (risaf == RISAF12_S) {
		
	}
	HAL_RIF_RISAF_ConfigBaseRegion(risaf_hw, 1U, &risaf_conf);
	if (risaf == RISAF12_S) {
		
	}
}

static void AppAI_ConfigureNpuRisafDefaults(void) {
	/* Keep the default ST security model so the AI runtime can reach the memory
	 * and fabric regions it expects during LL_ATON startup. */
	__HAL_RCC_RIFSC_CLK_ENABLE();
	__HAL_RCC_RISAF_CLK_ENABLE();

	
	AppAI_SetRisafDefault(RISAF2_S);
	

	
	AppAI_SetRisafDefault(RISAF3_S);
	

	
	AppAI_SetRisafDefault(RISAF4_S);
	

	
	AppAI_SetRisafDefault(RISAF5_S);
	

	
	AppAI_SetRisafDefault(RISAF6_S);
	

	
	AppAI_SetRisafDefault(RISAF7_S);
	

	/* RISAF12 programming currently stalls on this board even though the
	 * xSPI2 memory-mapped window is already enabled. Leave it untouched for
	 * now so we can validate whether the runtime can proceed without it. */
	

#if defined(RISAF8_S) && defined(RISAF15_S)
	
	AppAI_SetRisafDefault(RISAF8_S);
	AppAI_SetRisafDefault(RISAF15_S);
	
#endif
}

bool App_AI_RunDryInferenceFromYuv422(const uint8_t *frame_bytes,
		size_t frame_size) {
	const LL_Buffer_InfoTypeDef *input_info = NULL;
	const LL_Buffer_InfoTypeDef *output_info = NULL;
	float *input_ptr = NULL;
	const float *output_ptr = NULL;
	size_t input_len_bytes = 0U;
	size_t input_float_count = 0U;
	size_t output_len_bytes = 0U;

	if (!App_AI_Model_Init()) {
		
		return false;
	}

	input_info = AppAI_GetInputBufferInfo();
	output_info = AppAI_GetOutputBufferInfo();
	if ((input_info == NULL) || (output_info == NULL)) {
		
		return false;
	}

	input_ptr = (float *) LL_Buffer_addr_start(input_info);
	input_len_bytes = (size_t) LL_Buffer_len(input_info);
	input_float_count = input_len_bytes / sizeof(float);
	if (input_ptr == NULL) {
		
		return false;
	}

	DebugConsole_Printf(
			"[AI] RunDryInference start: frame_ptr=%p frame_size=%lu input=%s addr=%p len=%lu output=%s addr=%p len=%lu\r\n",
			(const void *) frame_bytes, (unsigned long) frame_size,
			(input_info->name != NULL) ? input_info->name : "(unnamed)",
			(void *) input_ptr, (unsigned long) input_len_bytes,
			(output_info->name != NULL) ? output_info->name : "(unnamed)",
			(void *) LL_Buffer_addr_start(output_info),
			(unsigned long) LL_Buffer_len(output_info));
	DebugConsole_Printf(
			"[AI] Model I/O dims: input_floats=%lu expected=%lu output_floats=%lu\r\n",
			(unsigned long) input_float_count,
			(unsigned long) APP_AI_MODEL_INPUT_FLOAT_COUNT,
			(unsigned long) (LL_Buffer_len(output_info) / sizeof(float)));

	if (!AppAI_PreprocessYuv422FrameToFloatInput(frame_bytes, frame_size,
			input_ptr, input_float_count)) {
		return false;
	}

	DebugConsole_Printf("[AI] Preprocess completed; logging tensor signatures.\r\n");
	AppAI_LogFrameSignature(frame_bytes, frame_size);
	AppAI_LogInputSignature(input_ptr, input_float_count);
	AppAI_LogInputTensorWindow(input_ptr, input_float_count);
	AppAI_LogTensorPatch("Tensor center", input_ptr,
			(size_t) APP_AI_CAPTURE_FRAME_WIDTH_PIXELS,
			(size_t) APP_AI_CAPTURE_FRAME_WIDTH_PIXELS / 2U,
			(size_t) APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS / 2U, 2U);

	/* Make sure the NPU sees the freshly prepared float input. */
	DebugConsole_Printf(
			"[AI] Cache clean input range: start=%p end=%p bytes=%lu\r\n",
			(void *) input_ptr,
			(void *) ((uintptr_t) input_ptr + input_len_bytes),
			(unsigned long) input_len_bytes);
	(void) mcu_cache_clean_range((uint32_t) (uintptr_t) input_ptr,
			(uint32_t) ((uintptr_t) input_ptr + input_len_bytes));
	DebugConsole_Printf("[AI] Cache clean complete.\r\n");

	LL_ATON_RT_Reset_Network(&NN_Instance_mobilenetv2_scalar_hardcase_warmstart_int8);
	DebugConsole_Printf("[AI] Network reset complete; entering epoch loop.\r\n");

	for (uint32_t epoch_step = 0U;; ++epoch_step) {
		

		const LL_ATON_RT_RetValues_t run_status = LL_ATON_RT_RunEpochBlock(
				&NN_Instance_mobilenetv2_scalar_hardcase_warmstart_int8);
		DebugConsole_Printf("[AI] Epoch step %lu status=%d\r\n",
				(unsigned long) epoch_step, (int) run_status);

		

		if (run_status == LL_ATON_RT_DONE) {
			DebugConsole_Printf("[AI] Epoch loop complete after %lu steps.\r\n",
					(unsigned long) (epoch_step + 1U));
			break;
		}

		/* Follow the ATON runtime contract so the NPU can wait on its own event. */
		if (run_status == LL_ATON_RT_WFE) {
			
			LL_ATON_OSAL_WFE();
			
		} else {
			tx_thread_relinquish();
		}
	}

	output_ptr = (const float *) LL_Buffer_addr_start(output_info);
	output_len_bytes = (size_t) LL_Buffer_len(output_info);
	if ((output_ptr == NULL) || (output_len_bytes < sizeof(float))) {
		
		return false;
	}

	/* Read the scalar output back after the runtime finishes. */
	DebugConsole_Printf(
			"[AI] Cache invalidate output range: start=%p end=%p bytes=%lu\r\n",
			(const void *) output_ptr,
			(const void *) ((uintptr_t) output_ptr + output_len_bytes),
			(unsigned long) output_len_bytes);
	(void) mcu_cache_invalidate_range((uint32_t) (uintptr_t) output_ptr,
			(uint32_t) ((uintptr_t) output_ptr + output_len_bytes));
	DebugConsole_Printf("[AI] Cache invalidate complete; reading output tensor.\r\n");

	AppAI_LogInferenceResult(output_info);

	return true;
}

/* USER CODE END 0 */

/* USER CODE BEGIN 1 */

static const LL_Buffer_InfoTypeDef *AppAI_GetInputBufferInfo(void) {
	const LL_Buffer_InfoTypeDef *input_info =
			LL_ATON_Input_Buffers_Info(
					&NN_Instance_mobilenetv2_scalar_hardcase_warmstart_int8);

	if ((input_info == NULL) || (input_info->name == NULL)) {
		return NULL;
	}

	return input_info;
}

static const LL_Buffer_InfoTypeDef *AppAI_GetOutputBufferInfo(void) {
	const LL_Buffer_InfoTypeDef *output_info =
			LL_ATON_Output_Buffers_Info(
					&NN_Instance_mobilenetv2_scalar_hardcase_warmstart_int8);

	if ((output_info == NULL) || (output_info->name == NULL)) {
		return NULL;
	}

	return output_info;
}

static const LL_Buffer_InfoTypeDef *AppAI_FindBufferInfoByName(
		const LL_Buffer_InfoTypeDef *buffer_list, const char *name) {
	if ((buffer_list == NULL) || (name == NULL)) {
		return NULL;
	}

	for (const LL_Buffer_InfoTypeDef *entry = buffer_list; entry->name != NULL;
			++entry) {
		if (strcmp(entry->name, name) == 0) {
			return entry;
		}
	}

