rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	return NULL;
}

static void AppAI_LogInferenceResult(
		const LL_Buffer_InfoTypeDef *output_buffer_info) {
	const LL_Buffer_InfoTypeDef *internal_buffers = NULL;
	const LL_Buffer_InfoTypeDef *quantize_output_info = NULL;
	const LL_Buffer_InfoTypeDef *sub_output_info = NULL;
	const LL_Buffer_InfoTypeDef *conv1_output_info = NULL;
	const LL_Buffer_InfoTypeDef *raw_output_info = NULL;
	const LL_Buffer_InfoTypeDef *scale_info = NULL;
	const LL_Buffer_InfoTypeDef *zero_point_info = NULL;
	union {
		float f;
		uint32_t u;
	} output_bits = {
		.f = 0.0f
	};
	float output_value = 0.0f;
	float head_scale = 1.0f;
	float output_dequant_scale = 1.0f;
	float head_dequant_value = 0.0f;
	int8_t raw_output_value = 0;
	int8_t head_zero_point = 0;
	int8_t output_zero_point = 0;

	if (output_buffer_info == NULL) {
		DebugConsole_Printf("[AI] Inference failed: no output buffer.\r\n");
		return;
	}

	DebugConsole_Printf(
			"[AI] Output buffer meta: name=%s addr=%p len=%lu\r\n",
			(output_buffer_info->name != NULL) ? output_buffer_info->name : "(unnamed)",
			LL_Buffer_addr_start(output_buffer_info),
			(unsigned long) LL_Buffer_len(output_buffer_info));

	(void) memcpy(&output_bits.u, LL_Buffer_addr_start(output_buffer_info),
			sizeof(output_bits.u));
	output_value = output_bits.f;

	internal_buffers =
			LL_ATON_Internal_Buffers_Info(
					&NN_Instance_mobilenetv2_scalar_hardcase_warmstart_int8);
	quantize_output_info = AppAI_FindBufferInfoByName(internal_buffers,
			"Quantize_5_out_0");
	sub_output_info = AppAI_FindBufferInfoByName(internal_buffers,
			"Sub_13_out_0");
	conv1_output_info = AppAI_FindBufferInfoByName(internal_buffers,
			"Conv2D_19_zero_off_out_22");
	raw_output_info = AppAI_FindBufferInfoByName(internal_buffers,
			"Gemm_259_out_0");
	scale_info = AppAI_FindBufferInfoByName(internal_buffers,
			"Dequantize_261_x_scale");
	zero_point_info = AppAI_FindBufferInfoByName(internal_buffers,
			"Dequantize_261_x_zero_point");

	AppAI_LogBufferInfoAndSignature("Quantize_5_out_0",
			quantize_output_info);
	AppAI_LogBufferInfoAndSignature("Sub_13_out_0", sub_output_info);
	AppAI_LogBufferInfoAndSignature("Conv2D_19_zero_off_out_22",
			conv1_output_info);
	AppAI_LogBufferInfoAndSignature("Gemm_259_out_0", raw_output_info);
	AppAI_LogBufferInfoAndSignature("Dequantize_261_out_0", output_buffer_info);

	if ((raw_output_info != NULL) && (LL_Buffer_addr_start(raw_output_info) != NULL)) {
		raw_output_value = *(const int8_t *) LL_Buffer_addr_start(raw_output_info);
	}

	DebugConsole_Printf(
			"[AI] Raw tensor meta: name=%s addr=%p len=%lu\r\n",
			(raw_output_info != NULL) ? raw_output_info->name : "(missing)",
			(raw_output_info != NULL) ? (void *) LL_Buffer_addr_start(raw_output_info) : NULL,
			(raw_output_info != NULL) ? (unsigned long) LL_Buffer_len(raw_output_info) : 0UL);

	if ((scale_info != NULL) && (LL_Buffer_addr_start(scale_info) != NULL)) {
		(void) memcpy(&output_dequant_scale, LL_Buffer_addr_start(scale_info),
				sizeof(output_dequant_scale));
	}

	if ((zero_point_info != NULL)
			&& (LL_Buffer_addr_start(zero_point_info) != NULL)) {
		output_zero_point = *(const int8_t *) LL_Buffer_addr_start(
				zero_point_info);
	}

	if (raw_output_info != NULL) {
		const void *raw_output_addr = LL_Buffer_addr_start(raw_output_info);

		if (raw_output_addr != NULL) {
			raw_output_value = *(const int8_t *) raw_output_addr;
			if ((raw_output_info->scale != NULL)
					&& (raw_output_info->offset != NULL)) {
				(void) memcpy(&head_scale, raw_output_info->scale,
						sizeof(head_scale));
				head_zero_point = *(const int16_t *) raw_output_info->offset;
			}
			head_dequant_value = ((float) raw_output_value
					- (float) head_zero_point) * head_scale;
		}
	}

	output_value = AppInferenceCalibration_Apply(output_value);

	/* Log both the final float output and the raw int8 tensor so we can spot
	 * quantization mismatches without changing the model result path. */
	DebugConsole_Printf(
			"[AI] raw=%d head_zp=%d output_bits=0x%08lx output_zp=%d\r\n",
			(int) raw_output_value,
			(int) head_zero_point,
			(unsigned long) output_bits.u,
			(int) output_zero_point);
	AppAI_LogFloatApprox("[AI] head_scale: ", head_scale);
	AppAI_LogFloatApprox("[AI] head_dequant: ", head_dequant_value);
	AppAI_LogFloatApprox("[AI] output_scale: ", output_dequant_scale);
	AppAI_LogFloatApprox("[AI] output_zero_point: ", (float) output_zero_point);
	AppAI_LogFloatApprox("[AI] Inference output value: ", output_value);

	app_ai_last_inference_value = output_value;
	app_ai_last_inference_valid = true;
}

static int AppAI_ApplyCacheRange(uint32_t start_addr, uint32_t end_addr,
		bool clean, bool invalidate) {
	uintptr_t start = 0U;
	uintptr_t end = 0U;

	if (end_addr <= start_addr) {
		return -1;
	}

	start = (uintptr_t) start_addr;
	end = (uintptr_t) end_addr;

	start &= ~((uintptr_t) APP_AI_CACHE_LINE_BYTES - 1U);
	end = (end + APP_AI_CACHE_LINE_BYTES - 1U)
			& ~((uintptr_t) APP_AI_CACHE_LINE_BYTES - 1U);

	if (clean) {
		SCB_CleanDCache_by_Addr((uint32_t *) start, (int32_t) (end - start));
	}

	if (invalidate) {
		SCB_InvalidateDCache_by_Addr((uint32_t *) start,
				(int32_t) (end - start));
	}

	return 0;
}

static bool AppAI_PreprocessYuv422FrameToFloatInput(const uint8_t *frame_bytes,
		size_t frame_size, float *input_ptr, size_t input_float_count) {
	const size_t source_width = (size_t) APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
	const size_t source_height = (size_t) APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
	size_t crop_x_min = 0U;
	size_t crop_y_min = 0U;
	size_t crop_width = source_width;
	size_t crop_height = source_height;
	bool crop_found = false;

	if ((frame_bytes == NULL) || (input_ptr == NULL)) {
		
		return false;
	}

	if ((frame_size < (size_t) APP_AI_CAPTURE_FRAME_BYTES)
			|| (input_float_count < (size_t) APP_AI_MODEL_INPUT_FLOAT_COUNT)) {
		
		return false;
	}

	DebugConsole_Printf(
			"[AI] Preprocess begin: frame_ptr=%p frame_size=%lu input_ptr=%p input_floats=%lu source=%lux%lu\r\n",
			(const void *) frame_bytes, (unsigned long) frame_size,
			(void *) input_ptr, (unsigned long) input_float_count,
			(unsigned long) source_width, (unsigned long) source_height);

	/* DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1 emits packed YUYV samples:
	 *   byte 0 = Y0, byte 1 = U, byte 2 = Y1, byte 3 = V, ...
	 * We estimate the gauge position from the bright dial face, crop around
	 * that box, and then resize with padding to match the model input. */
	crop_found = AppAI_EstimateGaugeCropBoxFromYuv422(frame_bytes, frame_size,
			source_width, source_height, &crop_x_min, &crop_y_min, &crop_width,
			&crop_height);
	if (!crop_found) {
		crop_x_min = (size_t) ((float) source_width
				* APP_AI_TRAINING_CROP_X_MIN_RATIO);
		crop_y_min = (size_t) ((float) source_height
				* APP_AI_TRAINING_CROP_Y_MIN_RATIO);
		crop_width = (size_t) ((float) source_width
				* (APP_AI_TRAINING_CROP_X_MAX_RATIO
				- APP_AI_TRAINING_CROP_X_MIN_RATIO));
		crop_height = (size_t) ((float) source_height
				* (APP_AI_TRAINING_CROP_Y_MAX_RATIO
				- APP_AI_TRAINING_CROP_Y_MIN_RATIO));
		if (crop_width == 0U) {
			crop_width = 1U;
		}
		if (crop_height == 0U) {
			crop_height = 1U;
		}
	}

