rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	DebugConsole_Printf(
			"[AI] Crop %s: x=%lu y=%lu w=%lu h=%lu\r\n",
			crop_found ? "adaptive" : "fallback",
			(unsigned long) crop_x_min, (unsigned long) crop_y_min,
			(unsigned long) crop_width, (unsigned long) crop_height);
	DebugConsole_Printf(
			"[AI] Preprocess geometry: scale from crop to tensor will be computed after padding. crop_x_max=%lu crop_y_max=%lu\r\n",
			(unsigned long) ((crop_x_min + crop_width) - 1U),
			(unsigned long) ((crop_y_min + crop_height) - 1U));

	AppAI_LogSourceCropWindow(frame_bytes, frame_size, source_width,
			source_height, crop_x_min, crop_y_min, crop_width, crop_height);

	(void) memset(input_ptr, 0, input_float_count * sizeof(float));

	{
		const size_t output_width = (size_t) APP_AI_CAPTURE_FRAME_WIDTH_PIXELS;
		const size_t output_height = (size_t) APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS;
		const float width_scale = (float) output_width / (float) crop_width;
		const float height_scale = (float) output_height / (float) crop_height;
		const float scale = (width_scale < height_scale) ? width_scale
				: height_scale;
		const size_t scaled_width = (size_t) ((float) crop_width * scale + 0.5f);
		const size_t scaled_height = (size_t) ((float) crop_height * scale + 0.5f);
		const size_t pad_x = (output_width > scaled_width) ?
				((output_width - scaled_width) / 2U) : 0U;
		const size_t pad_y = (output_height > scaled_height) ?
				((output_height - scaled_height) / 2U) : 0U;
		const size_t crop_x_max_index = (crop_width > 0U) ? (crop_width - 1U) : 0U;
		const size_t crop_y_max_index = (crop_height > 0U) ? (crop_height - 1U) : 0U;
		const size_t probe_x = (pad_x + (scaled_width / 2U) < output_width) ?
				(pad_x + (scaled_width / 2U)) : (output_width - 1U);
		const size_t probe_top_y = (pad_y + (scaled_height / 4U) < output_height) ?
				(pad_y + (scaled_height / 4U)) : (output_height - 1U);
		const size_t probe_mid_y = (pad_y + (scaled_height / 2U) < output_height) ?
				(pad_y + (scaled_height / 2U)) : (output_height - 1U);
		const size_t probe_bottom_y = (pad_y + ((scaled_height * 3U) / 4U) <
				output_height) ? (pad_y + ((scaled_height * 3U) / 4U))
				: (output_height - 1U);
		size_t nonzero_write_count = 0U;

		DebugConsole_Printf(
				"[AI] Resize plan: output=%lux%lu scale=%lu.%03lu scaled=%lux%lu pad=(%lu,%lu) crop_max=(%lu,%lu) probes=(%lu,%lu,%lu)\r\n",
				(unsigned long) output_width, (unsigned long) output_height,
				(unsigned long) (scale),
				(unsigned long) ((scale - (float) ((unsigned long) scale)) * 1000.0f),
				(unsigned long) scaled_width, (unsigned long) scaled_height,
				(unsigned long) pad_x, (unsigned long) pad_y,
				(unsigned long) crop_x_max_index, (unsigned long) crop_y_max_index,
				(unsigned long) probe_top_y, (unsigned long) probe_mid_y,
				(unsigned long) probe_bottom_y);

		for (size_t out_y = 0U; out_y < output_height; out_y++) {
			if ((out_y < pad_y) || (out_y >= (pad_y + scaled_height))) {
				continue;
			}

			const float crop_y_f = ((float) (out_y - pad_y)) / scale;
			size_t crop_y0 = (size_t) crop_y_f;
			size_t crop_y1 = (crop_y0 < crop_y_max_index) ? (crop_y0 + 1U)
					: crop_y_max_index;
			float crop_y_frac = crop_y_f - (float) crop_y0;

			if (crop_y0 >= crop_y_max_index) {
				crop_y0 = crop_y_max_index;
				crop_y1 = crop_y_max_index;
				crop_y_frac = 0.0f;
			}

			for (size_t out_x = 0U; out_x < output_width; out_x++) {
				const size_t dest_pixel_index = (out_y * output_width) + out_x;
				float crop_x_frac = 0.0f;
				float crop_x_f = 0.0f;
				size_t crop_x0 = 0U;
				size_t crop_x1 = 0U;
				float r00 = 0.0f;
				float g00 = 0.0f;
				float b00 = 0.0f;
				float r10 = 0.0f;
				float g10 = 0.0f;
				float b10 = 0.0f;
				float r01 = 0.0f;
				float g01 = 0.0f;
				float b01 = 0.0f;
				float r11 = 0.0f;
				float g11 = 0.0f;
				float b11 = 0.0f;
				float top_r = 0.0f;
				float top_g = 0.0f;
				float top_b = 0.0f;
				float bottom_r = 0.0f;
				float bottom_g = 0.0f;
				float bottom_b = 0.0f;
				float out_r = 0.0f;
				float out_g = 0.0f;
				float out_b = 0.0f;

				if ((out_x < pad_x) || (out_x >= (pad_x + scaled_width))) {
					continue;
				}

				crop_x_f = ((float) (out_x - pad_x)) / scale;
				crop_x0 = (size_t) crop_x_f;
				crop_x1 = (crop_x0 < crop_x_max_index) ? (crop_x0 + 1U)
						: crop_x_max_index;
				crop_x_frac = crop_x_f - (float) crop_x0;

				if (crop_x0 >= crop_x_max_index) {
					crop_x0 = crop_x_max_index;
					crop_x1 = crop_x_max_index;
					crop_x_frac = 0.0f;
				}

				AppAI_ReadRgbFromYuv422Pixel(frame_bytes, source_width,
						crop_x_min + crop_x0, crop_y_min + crop_y0, &r00, &g00,
						&b00);
				AppAI_ReadRgbFromYuv422Pixel(frame_bytes, source_width,
						crop_x_min + crop_x1, crop_y_min + crop_y0, &r10, &g10,
						&b10);
				AppAI_ReadRgbFromYuv422Pixel(frame_bytes, source_width,
						crop_x_min + crop_x0, crop_y_min + crop_y1, &r01, &g01,
						&b01);
				AppAI_ReadRgbFromYuv422Pixel(frame_bytes, source_width,
						crop_x_min + crop_x1, crop_y_min + crop_y1, &r11, &g11,
						&b11);

				top_r = r00 + ((r10 - r00) * crop_x_frac);
				top_g = g00 + ((g10 - g00) * crop_x_frac);
				top_b = b00 + ((b10 - b00) * crop_x_frac);
				bottom_r = r01 + ((r11 - r01) * crop_x_frac);
				bottom_g = g01 + ((g11 - g01) * crop_x_frac);
				bottom_b = b01 + ((b11 - b01) * crop_x_frac);
				out_r = top_r + ((bottom_r - top_r) * crop_y_frac);
				out_g = top_g + ((bottom_g - top_g) * crop_y_frac);
				out_b = top_b + ((bottom_b - top_b) * crop_y_frac);

				input_ptr[dest_pixel_index * 3U + 0U] =
						AppAI_ClampNormalizedFloat(out_r);
				input_ptr[dest_pixel_index * 3U + 1U] =
						AppAI_ClampNormalizedFloat(out_g);
				input_ptr[dest_pixel_index * 3U + 2U] =
						AppAI_ClampNormalizedFloat(out_b);

				if ((out_r > 0.0f) || (out_g > 0.0f) || (out_b > 0.0f)) {
					nonzero_write_count++;
				}

				/* Sample a few pixels at write time so we can tell whether the
				 * preprocessing math is producing values or whether the tensor is
				 * being cleared somewhere else after the write. */
				if ((out_x == probe_x) && (out_y == probe_top_y)) {
					const size_t dest_base = dest_pixel_index * 3U;
					const uint8_t src_luma00 = AppAI_ReadYuv422Luma(frame_bytes,
							source_width, crop_x_min + crop_x0, crop_y_min + crop_y0);
					const uint8_t src_luma10 = AppAI_ReadYuv422Luma(frame_bytes,
							source_width, crop_x_min + crop_x1, crop_y_min + crop_y0);
					const uint8_t src_luma01 = AppAI_ReadYuv422Luma(frame_bytes,
							source_width, crop_x_min + crop_x0, crop_y_min + crop_y1);
					const uint8_t src_luma11 = AppAI_ReadYuv422Luma(frame_bytes,
							source_width, crop_x_min + crop_x1, crop_y_min + crop_y1);
					const unsigned long calc_r_milli =
							(unsigned long) ((AppAI_ClampNormalizedFloat(out_r)
									* 1000.0f) + 0.5f);
					const unsigned long calc_g_milli =
							(unsigned long) ((AppAI_ClampNormalizedFloat(out_g)
									* 1000.0f) + 0.5f);
					const unsigned long calc_b_milli =
							(unsigned long) ((AppAI_ClampNormalizedFloat(out_b)
									* 1000.0f) + 0.5f);
					const unsigned long stored_r_milli =
							(unsigned long) ((input_ptr[dest_base + 0U] * 1000.0f)
									+ 0.5f);
					const unsigned long stored_g_milli =
							(unsigned long) ((input_ptr[dest_base + 1U] * 1000.0f)
									+ 0.5f);
					const unsigned long stored_b_milli =
							(unsigned long) ((input_ptr[dest_base + 2U] * 1000.0f)
									+ 0.5f);

