rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
					DebugConsole_Printf(
							"[AI] Write probe top: out=(%lu,%lu) crop0=(%lu,%lu) crop1=(%lu,%lu) frac=[%lu %lu] src_luma=[%u %u %u %u] r00g00b00=[%lu %lu %lu] r10g10b10=[%lu %lu %lu] r01g01b01=[%lu %lu %lu] r11g11b11=[%lu %lu %lu] top=[%lu %lu %lu] bottom=[%lu %lu %lu] out=[%lu %lu %lu] calc=[%lu %lu %lu] stored_milli=[%lu %lu %lu]\r\n",
							(unsigned long) out_x, (unsigned long) out_y,
							(unsigned long) (crop_x_min + crop_x0),
							(unsigned long) (crop_y_min + crop_y0),
							(unsigned long) (crop_x_min + crop_x1),
							(unsigned long) (crop_y_min + crop_y1),
							(unsigned long) ((crop_x_frac * 1000.0f) + 0.5f),
							(unsigned long) ((crop_y_frac * 1000.0f) + 0.5f),
							(unsigned int) src_luma00, (unsigned int) src_luma10,
							(unsigned int) src_luma01, (unsigned int) src_luma11,
							(unsigned long) ((AppAI_ClampNormalizedFloat(r00) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(g00) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(b00) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(r10) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(g10) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(b10) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(r01) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(g01) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(b01) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(r11) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(g11) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(b11) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(top_r) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(top_g) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(top_b) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(bottom_r) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(bottom_g) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(bottom_b) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(out_r) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(out_g) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(out_b) * 1000.0f) + 0.5f),
							calc_r_milli, calc_g_milli, calc_b_milli,
							stored_r_milli, stored_g_milli, stored_b_milli);
				}

				if ((out_x == probe_x) && (out_y == probe_mid_y)) {
					const size_t dest_base = dest_pixel_index * 3U;
					const uint8_t src_luma00 = AppAI_ReadYuv422Luma(frame_bytes,
							source_width, crop_x_min + crop_x0, crop_y_min + crop_y0);
					const uint8_t src_luma10 = AppAI_ReadYuv422Luma(frame_bytes,
							source_width, crop_x_min + crop_x1, crop_y_min + crop_y0);
					const uint8_t src_luma01 = AppAI_ReadYuv422Luma(frame_bytes,
							source_width, crop_x_min + crop_x0, crop_y_min + crop_y1);
					const uint8_t src_luma11 = AppAI_ReadYuv422Luma(frame_bytes,
							source_width, crop_x_min + crop_x1, crop_y_min + crop_y1);
					const unsigned long calc_r_milli =
							(unsigned long) ((AppAI_ClampNormalizedFloat(out_r)
									* 1000.0f) + 0.5f);
					const unsigned long calc_g_milli =
							(unsigned long) ((AppAI_ClampNormalizedFloat(out_g)
									* 1000.0f) + 0.5f);
					const unsigned long calc_b_milli =
							(unsigned long) ((AppAI_ClampNormalizedFloat(out_b)
									* 1000.0f) + 0.5f);
					const unsigned long stored_r_milli =
							(unsigned long) ((input_ptr[dest_base + 0U] * 1000.0f)
									+ 0.5f);
					const unsigned long stored_g_milli =
							(unsigned long) ((input_ptr[dest_base + 1U] * 1000.0f)
									+ 0.5f);
					const unsigned long stored_b_milli =
							(unsigned long) ((input_ptr[dest_base + 2U] * 1000.0f)
									+ 0.5f);

					DebugConsole_Printf(
							"[AI] Write probe mid: out=(%lu,%lu) crop0=(%lu,%lu) crop1=(%lu,%lu) frac=[%lu %lu] src_luma=[%u %u %u %u] r00g00b00=[%lu %lu %lu] r10g10b10=[%lu %lu %lu] r01g01b01=[%lu %lu %lu] r11g11b11=[%lu %lu %lu] top=[%lu %lu %lu] bottom=[%lu %lu %lu] out=[%lu %lu %lu] calc=[%lu %lu %lu] stored_milli=[%lu %lu %lu]\r\n",
							(unsigned long) out_x, (unsigned long) out_y,
							(unsigned long) (crop_x_min + crop_x0),
							(unsigned long) (crop_y_min + crop_y0),
							(unsigned long) (crop_x_min + crop_x1),
							(unsigned long) (crop_y_min + crop_y1),
							(unsigned long) ((crop_x_frac * 1000.0f) + 0.5f),
							(unsigned long) ((crop_y_frac * 1000.0f) + 0.5f),
							(unsigned int) src_luma00, (unsigned int) src_luma10,
							(unsigned int) src_luma01, (unsigned int) src_luma11,
							(unsigned long) ((AppAI_ClampNormalizedFloat(r00) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(g00) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(b00) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(r10) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(g10) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(b10) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(r01) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(g01) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(b01) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(r11) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(g11) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(b11) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(top_r) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(top_g) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(top_b) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(bottom_r) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(bottom_g) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(bottom_b) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(out_r) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(out_g) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(out_b) * 1000.0f) + 0.5f),
							calc_r_milli, calc_g_milli, calc_b_milli,
							stored_r_milli, stored_g_milli, stored_b_milli);

					{
						uint8_t quad00[4U] = { 0U };
						uint8_t quad10[4U] = { 0U };
						uint8_t quad01[4U] = { 0U };
						uint8_t quad11[4U] = { 0U };

