rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
						AppAI_ReadYuv422Quartet(frame_bytes, source_width,
								crop_x_min + crop_x0, crop_y_min + crop_y0, quad00);
						AppAI_ReadYuv422Quartet(frame_bytes, source_width,
								crop_x_min + crop_x1, crop_y_min + crop_y0, quad10);
						AppAI_ReadYuv422Quartet(frame_bytes, source_width,
								crop_x_min + crop_x0, crop_y_min + crop_y1, quad01);
						AppAI_ReadYuv422Quartet(frame_bytes, source_width,
								crop_x_min + crop_x1, crop_y_min + crop_y1, quad11);

						DebugConsole_Printf(
								"[AI] Probe mid raw quartets: q00=[%u %u %u %u] q10=[%u %u %u %u] q01=[%u %u %u %u] q11=[%u %u %u %u]\r\n",
								(unsigned int) quad00[0], (unsigned int) quad00[1],
								(unsigned int) quad00[2], (unsigned int) quad00[3],
								(unsigned int) quad10[0], (unsigned int) quad10[1],
								(unsigned int) quad10[2], (unsigned int) quad10[3],
								(unsigned int) quad01[0], (unsigned int) quad01[1],
								(unsigned int) quad01[2], (unsigned int) quad01[3],
								(unsigned int) quad11[0], (unsigned int) quad11[1],
								(unsigned int) quad11[2], (unsigned int) quad11[3]);
					}

					AppAI_LogSourcePatch("Probe mid source", frame_bytes,
							source_width, crop_x_min + crop_x0,
							crop_y_min + crop_y0, 2U);
					AppAI_LogTensorPatch("Probe mid tensor", input_ptr,
							output_width, out_x, out_y, 2U);
				}

				if ((out_x == probe_x) && (out_y == probe_bottom_y)) {
					const size_t dest_base = dest_pixel_index * 3U;
					const uint8_t src_luma00 = AppAI_ReadYuv422Luma(frame_bytes,
							source_width, crop_x_min + crop_x0, crop_y_min + crop_y0);
					const uint8_t src_luma10 = AppAI_ReadYuv422Luma(frame_bytes,
							source_width, crop_x_min + crop_x1, crop_y_min + crop_y0);
					const uint8_t src_luma01 = AppAI_ReadYuv422Luma(frame_bytes,
							source_width, crop_x_min + crop_x0, crop_y_min + crop_y1);
					const uint8_t src_luma11 = AppAI_ReadYuv422Luma(frame_bytes,
							source_width, crop_x_min + crop_x1, crop_y_min + crop_y1);
					const unsigned long calc_r_milli =
							(unsigned long) ((AppAI_ClampNormalizedFloat(out_r)
									* 1000.0f) + 0.5f);
					const unsigned long calc_g_milli =
							(unsigned long) ((AppAI_ClampNormalizedFloat(out_g)
									* 1000.0f) + 0.5f);
					const unsigned long calc_b_milli =
							(unsigned long) ((AppAI_ClampNormalizedFloat(out_b)
									* 1000.0f) + 0.5f);
					const unsigned long stored_r_milli =
							(unsigned long) ((input_ptr[dest_base + 0U] * 1000.0f)
									+ 0.5f);
					const unsigned long stored_g_milli =
							(unsigned long) ((input_ptr[dest_base + 1U] * 1000.0f)
									+ 0.5f);
					const unsigned long stored_b_milli =
							(unsigned long) ((input_ptr[dest_base + 2U] * 1000.0f)
									+ 0.5f);

					DebugConsole_Printf(
							"[AI] Write probe bottom: out=(%lu,%lu) crop0=(%lu,%lu) crop1=(%lu,%lu) frac=[%lu %lu] src_luma=[%u %u %u %u] r00g00b00=[%lu %lu %lu] r10g10b10=[%lu %lu %lu] r01g01b01=[%lu %lu %lu] r11g11b11=[%lu %lu %lu] top=[%lu %lu %lu] bottom=[%lu %lu %lu] out=[%lu %lu %lu] calc=[%lu %lu %lu] stored_milli=[%lu %lu %lu]\r\n",
							(unsigned long) out_x, (unsigned long) out_y,
							(unsigned long) (crop_x_min + crop_x0),
							(unsigned long) (crop_y_min + crop_y0),
							(unsigned long) (crop_x_min + crop_x1),
							(unsigned long) (crop_y_min + crop_y1),
							(unsigned long) ((crop_x_frac * 1000.0f) + 0.5f),
							(unsigned long) ((crop_y_frac * 1000.0f) + 0.5f),
							(unsigned int) src_luma00, (unsigned int) src_luma10,
							(unsigned int) src_luma01, (unsigned int) src_luma11,
							(unsigned long) ((AppAI_ClampNormalizedFloat(r00) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(g00) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(b00) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(r10) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(g10) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(b10) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(r01) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(g01) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(b01) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(r11) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(g11) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(b11) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(top_r) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(top_g) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(top_b) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(bottom_r) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(bottom_g) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(bottom_b) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(out_r) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(out_g) * 1000.0f) + 0.5f),
							(unsigned long) ((AppAI_ClampNormalizedFloat(out_b) * 1000.0f) + 0.5f),
							calc_r_milli, calc_g_milli, calc_b_milli,
							stored_r_milli, stored_g_milli, stored_b_milli);
				}
			}
		}

		DebugConsole_Printf(
				"[AI] Preprocess write summary: nonzero_pixels=%lu\r\n",
				(unsigned long) nonzero_write_count);

		{
			const size_t tensor_center_index =
					(((APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS / 2U)
							* APP_AI_CAPTURE_FRAME_WIDTH_PIXELS)
							+ (APP_AI_CAPTURE_FRAME_WIDTH_PIXELS / 2U)) * 3U;
			const size_t tensor_q1_index =
					(((APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS / 4U)
							* APP_AI_CAPTURE_FRAME_WIDTH_PIXELS)
							+ (APP_AI_CAPTURE_FRAME_WIDTH_PIXELS / 4U)) * 3U;
			const size_t tensor_q3_index =
					((((APP_AI_CAPTURE_FRAME_HEIGHT_PIXELS * 3U) / 4U)
							* APP_AI_CAPTURE_FRAME_WIDTH_PIXELS)
							+ ((APP_AI_CAPTURE_FRAME_WIDTH_PIXELS * 3U) / 4U)) * 3U;
			DebugConsole_Printf(
					"[AI] Preprocess post-write probes: center=[%lu %lu %lu] q1=[%lu %lu %lu] q3=[%lu %lu %lu] base=[%lu %lu %lu %lu %lu %lu %lu %lu]\r\n",
					(unsigned long) ((input_ptr[tensor_center_index + 0U] * 1000.0f) + 0.5f),
					(unsigned long) ((input_ptr[tensor_center_index + 1U] * 1000.0f) + 0.5f),
					(unsigned long) ((input_ptr[tensor_center_index + 2U] * 1000.0f) + 0.5f),
					(unsigned long) ((input_ptr[tensor_q1_index + 0U] * 1000.0f) + 0.5f),
					(unsigned long) ((input_ptr[tensor_q1_index + 1U] * 1000.0f) + 0.5f),
					(unsigned long) ((input_ptr[tensor_q1_index + 2U] * 1000.0f) + 0.5f),
					(unsigned long) ((input_ptr[tensor_q3_index + 0U] * 1000.0f) + 0.5f),
					(unsigned long) ((input_ptr[tensor_q3_index + 1U] * 1000.0f) + 0.5f),
					(unsigned long) ((input_ptr[tensor_q3_index + 2U] * 1000.0f) + 0.5f),
					(unsigned long) ((input_ptr[0U] * 1000.0f) + 0.5f),
					(unsigned long) ((input_ptr[1U] * 1000.0f) + 0.5f),
					(unsigned long) ((input_ptr[2U] * 1000.0f) + 0.5f),
					(unsigned long) ((input_ptr[3U] * 1000.0f) + 0.5f),
					(unsigned long) ((input_ptr[4U] * 1000.0f) + 0.5f),
					(unsigned long) ((input_ptr[5U] * 1000.0f) + 0.5f),
					(unsigned long) ((input_ptr[6U] * 1000.0f) + 0.5f),
					(unsigned long) ((input_ptr[7U] * 1000.0f) + 0.5f));
		}
	}

