rishi-latchmepersad/embedded-gauge-reading-tinyml/firmware/stm32/n657/Appli/Src/app_ai.c
	return true;
}

static float AppAI_ClampNormalizedFloat(float value) {
	if (value < 0.0f) {
		return 0.0f;
	}

	if (value > 1.0f) {
		return 1.0f;
	}

	return value;
}

static uint8_t AppAI_ReadYuv422Luma(const uint8_t *frame_bytes,
		size_t frame_width_pixels, size_t source_x, size_t source_y) {
	const size_t pair_x = source_x & ~1U;
	const size_t source_index = ((source_y * frame_width_pixels) + pair_x) * 2U;
	const bool is_second_pixel = ((source_x & 1U) != 0U);

	if (frame_bytes == NULL) {
		return 0U;
	}

	return frame_bytes[source_index + (is_second_pixel ? 2U : 0U)];
}

static void AppAI_ReadYuv422Quartet(const uint8_t *frame_bytes,
		size_t frame_width_pixels, size_t source_x, size_t source_y,
		uint8_t *quad_out) {
	const size_t pair_x = source_x & ~1U;
	const size_t source_index = ((source_y * frame_width_pixels) + pair_x) * 2U;

	if ((frame_bytes == NULL) || (quad_out == NULL)) {
		return;
	}

	quad_out[0] = frame_bytes[source_index + 0U];
	quad_out[1] = frame_bytes[source_index + 1U];
	quad_out[2] = frame_bytes[source_index + 2U];
	quad_out[3] = frame_bytes[source_index + 3U];
}

static float AppAI_ReadNormalizedGrayFromYuv422Pixel(const uint8_t *frame_bytes,
		size_t frame_width_pixels, size_t source_x, size_t source_y) {
	const uint8_t luma = AppAI_ReadYuv422Luma(frame_bytes, frame_width_pixels,
			source_x, source_y);
	const float normalized = ((float) luma) / 255.0f;

	return AppAI_ClampNormalizedFloat(normalized);
}

static void AppAI_ReadRgbFromYuv422Pixel(const uint8_t *frame_bytes,
		size_t frame_width_pixels, size_t source_x, size_t source_y,
		float *r_out, float *g_out, float *b_out) {
#if APP_AI_YUV422_INPUT_LUMA_ONLY
	const float gray = AppAI_ReadNormalizedGrayFromYuv422Pixel(frame_bytes,
			frame_width_pixels, source_x, source_y);
	const float r = gray;
	const float g = gray;
	const float b = gray;
#else
	const size_t pair_x = source_x & ~1U;
	const size_t source_index = ((source_y * frame_width_pixels) + pair_x) * 2U;
	const bool is_second_pixel = ((source_x & 1U) != 0U);
	const float y = ((float) frame_bytes[source_index + (is_second_pixel ? 2U : 0U)]
			- 16.0f) * 1.1643836f;
	const float u = (float) frame_bytes[source_index + 1U] - 128.0f;
	const float v = (float) frame_bytes[source_index + 3U] - 128.0f;
	const float r = (y + (1.5960268f * v)) / 255.0f;
	const float g = (y - (0.3917623f * u) - (0.8129677f * v)) / 255.0f;
	const float b = (y + (2.0172322f * u)) / 255.0f;
#endif

	if (r_out != NULL) {
		*r_out = AppAI_ClampNormalizedFloat(r);
	}
	if (g_out != NULL) {
		*g_out = AppAI_ClampNormalizedFloat(g);
	}
	if (b_out != NULL) {
		*b_out = AppAI_ClampNormalizedFloat(b);
	}
}

bool App_AI_GetLastInferenceResult(float *value_out) {
	if (value_out == NULL) {
		return false;
	}
	if (!app_ai_last_inference_valid) {
		return false;
	}
	*value_out = app_ai_last_inference_value;
	return true;
}

/* USER CODE END 1 */
